src/service_layer/sample/SOAP/cartset/getCartsetResponse.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<getCartset xmlns="http://www.dps.org/dps/cartset"
			xmlns:ns2="http://www.dps.org/dps/dto" xmlns:ns3="http://www.dps.org/dps/common">
			<permissionedCartset>
				<ns3:execute>true</ns3:execute>
				<ns3:read>true</ns3:read>
				<ns3:write>true</ns3:write>
				<ns2:item>
					<ns2:allExecute>true</ns2:allExecute>
					<ns2:allRead>true</ns2:allRead>
					<ns2:allWrite>true</ns2:allWrite>
					<ns2:created>1970-01-01T00:00:00+01:00
					</ns2:created>
					<ns2:entityType>1</ns2:entityType>
					<ns2:fileID>20</ns2:fileID>
					<ns2:filename>Phils Cartwall</ns2:filename>
					<ns2:groupExecute>true</ns2:groupExecute>
					<ns2:groupRead>true</ns2:groupRead>
					<ns2:groupWrite>true</ns2:groupWrite>
					<ns2:lastUpdated>1970-01-01T00:00:00+01:00
					</ns2:lastUpdated>
					<ns2:owner>
						<ns2:enabled>true</ns2:enabled>
						<ns2:ghost>false</ns2:ghost>
						<ns2:userID>1</ns2:userID>
						<ns2:username>Jim</ns2:username>
					</ns2:owner>
					<ns2:ownerGroup>
						<ns2:description>The Best Group</ns2:description>
						<ns2:groupID>1</ns2:groupID>
						<ns2:name>Jims Group</ns2:name>
					</ns2:ownerGroup>
					<ns2:parentID>0</ns2:parentID>
					<ns2:userExecute>true</ns2:userExecute>
					<ns2:userRead>true</ns2:userRead>
					<ns2:userWrite>true</ns2:userWrite>
					<ns2:cartwalls>
						<ns2:cartwall>
							<ns2:carts>
								<ns2:cart>
									<ns2:audioID>1</ns2:audioID>
									<ns2:cartAudioID>2</ns2:cartAudioID>
									<ns2:cartID>2</ns2:cartID>
									<ns2:cartStyleID>1</ns2:cartStyleID>
									<ns2:text>CART 2</ns2:text>
								</ns2:cart>
								<ns2:cart>
									<ns2:audioID>1</ns2:audioID>
									<ns2:cartAudioID>1</ns2:cartAudioID>
									<ns2:cartID>1</ns2:cartID>
									<ns2:cartStyleID>1</ns2:cartStyleID>
									<ns2:text>CART 1</ns2:text>
								</ns2:cart>
							</ns2:carts>
							<ns2:cartwallID>1</ns2:cartwallID>
							<ns2:description>FIRST WALL</ns2:description>
							<ns2:name>WALL 1</ns2:name>
							<ns2:page>0</ns2:page>
						</ns2:cartwall>
						<ns2:cartwall>
							<ns2:carts>
								<ns2:cart>
									<ns2:audioID>1</ns2:audioID>
									<ns2:cartAudioID>3</ns2:cartAudioID>
									<ns2:cartID>4</ns2:cartID>
									<ns2:cartStyleID>1</ns2:cartStyleID>
									<ns2:text>CART 4</ns2:text>
								</ns2:cart>
							</ns2:carts>
							<ns2:cartwallID>2</ns2:cartwallID>
							<ns2:description>SECOND WALL</ns2:description>
							<ns2:name>WALL 2</ns2:name>
							<ns2:page>1</ns2:page>
						</ns2:cartwall>
					</ns2:cartwalls>
					<ns2:description>A test cartwall</ns2:description>
					<ns2:name>Phils Cartwall</ns2:name>
				</ns2:item>
			</permissionedCartset>
		</getCartset>
	</soap:Body>
</soap:Envelope>
